"""
Напишіть функцію, що для даного рядка виконує наступне:

виведіть третій символ цього рядка.
виведіть передостанній символ цього рядка.
виведіть перші п'ять символів цього рядка.
виведіть весь рядок, крім двох останніх символів.
виведіть усі символи з парними індексами (вважаючи, що індексація починається з 0, тому символи виводяться починаючи з першого).
виведіть усі символи з непарними індексами, тобто, починаючи з другого символу рядка.
виведіть усі символи у зворотному порядку.
виведіть усі символи рядка через один у зворотному порядку, починаючи з останнього.
виведіть довжину цього рядка."""


def slice_text(text):
    s1 = text[2]
    t1 = "Третій символ                   - "
    s2 = text[-2]
    t2 = "Передостанній символ            - "
    s3 = text[:5]
    t3 = "Перші 5 символів                - "
    s4 = text[:-2]
    t4 = "крім двох останніх символів     - "
    s5 = text[1::2]
    t5 = "З парними індексами             - "
    s6 = text[::2]
    t6 = "З непарними індексами           - "
    s7 = text[::-1]
    t7 = "У зворотному порядку            - "
    s8 = text[::-2]
    t8 = "Через один у зворотному порядку - "
    s9 = len(text)
    t9 = "Довжину цього рядка             - "
    return f"{t1}{s1} \n{t2}{s2} \n{t3}{s3} \n{t4}{s4} \n{t5}{s5} \n{t6}{s6} \n{t7}{s7} \n{t8}{s8} \n{t9}{s9}"


def main():
    text = input("Enter string: ")
    print(slice_text(text))


if __name__ == "__main__":
    main()
